W7D5/reddit_clone/app/controllers/subs_controller.rb

    def index
        # debugger
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"