W7D5/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "cindy"], ["session_token", "icOXYmzSH_INJJnS_nXBng"], ["created_at", "2022-06-03 17:09:52.536270"], ["updated_at", "2022-06-03 17:09:52.536270"]]
---
    def create
        @user = User.new(user_params)

        if @user.save